app/controllers/home_controller.rb

  def sitter
    @users = User.all
---
SELECT "users".* FROM "users"